Sketch Lines created with Pick Wall must remain parallel to the Wall.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ConstrainedToWall { get; }
  Visual Basic
Public Shared ReadOnly Property ConstrainedToWall As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ConstrainedToWall {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace